app/controllers/battles_controller.rb

SELECT * FROM `battles`
---
  def index
    @battles = Battle.all

SELECT * FROM `battles` WHERE (`battles`.`id` = 1)
---
  def show
    @battle = Battle.find(params[:id])

SELECT * FROM `battles` WHERE (`battles`.`id` = 1)
---
  def edit
    @battle = Battle.find(params[:id])

INSERT INTO `battles` (`created_at`, `recap`, `updated_at`, `ship1_id`, `ship2_id`) VALUES('2009-11-24 04:34:23', NULL, '2009-11-24 04:34:23', NULL, NULL)
---
  def create
    @battle = Battle.new(params[:battle])

    @ship1 = Ship.find(@battle.ship1_id)
    @ship2 = Ship.find(@battle.ship2_id)
    @character = Character.find(1)
    @finished = Battle.battle(@ship1,@ship2)

    respond_to do |format|
      if @battle.save

SELECT * FROM `battles` WHERE (`battles`.`id` = 1)
---
  def update
    @battle = Battle.find(params[:id])

SELECT * FROM `battles` WHERE (`battles`.`id` = 1)
DELETE FROM `battles` WHERE `id` = 1
---
  def destroy
    @battle = Battle.find(params[:id])
    @battle.destroy