app/controllers/characters_controller.rb

SELECT * FROM `characters`
---
  def index
    @characters = Character.all

SELECT * FROM `characters` WHERE (`characters`.`id` = 1)
---
  def show
    @character = Character.find(params[:id])