app/controllers/information_controller.rb

  def index
    @information = Information.all
---
SELECT * FROM `information`

  def show
    @information = Information.find(params[:id])
---
SELECT * FROM `information` WHERE (`information`.`id` = 2053932785)