app/controllers/items_controller.rb

  def index
    @items = Item.all
---
SELECT * FROM `items`

  def create
    @item = Item.new(params[:item])

    respond_to do |format|
      if @item.save
---
INSERT INTO `items` (`name`, `speed_w`, `evasion_w`, `created_at`, `price_w`, `updated_at`, `attack_w`, `volume`, `hitpoints_w`, `accuracy_w`, `slot`) VALUES(NULL, NULL, NULL, '2009-11-24 04:34:23', NULL, '2009-11-24 04:34:23', NULL, NULL, NULL, NULL, NULL)

  def update
    @item = Item.find(params[:id])
---
SELECT * FROM `items` WHERE (`items`.`id` = 1)

  def destroy
    @item = Item.find(params[:id])
    @item.destroy
---
SELECT * FROM `items` WHERE (`items`.`id` = 1)
DELETE FROM `items` WHERE `id` = 1