app/controllers/merchants_controller.rb

  def index
    @merchants = Merchant.all
---
SELECT * FROM `merchants`

  def show
    @merchant = Merchant.find(params[:id])
---
SELECT * FROM `merchants` WHERE (`merchants`.`id` = 1)

  def edit
    @merchant = Merchant.find(params[:id])
---
SELECT * FROM `merchants` WHERE (`merchants`.`id` = 1)

  def create
    @merchant = Merchant.new(params[:merchant])

    respond_to do |format|
      if @merchant.save
---
INSERT INTO `merchants` (`name`, `created_at`, `updated_at`, `port_id`) VALUES(NULL, '2009-11-24 04:34:24', '2009-11-24 04:34:24', NULL)

  def update
    @merchant = Merchant.find(params[:id])
---
SELECT * FROM `merchants` WHERE (`merchants`.`id` = 1)

  def destroy
    @merchant = Merchant.find(params[:id])
    @merchant.destroy
---
SELECT * FROM `merchants` WHERE (`merchants`.`id` = 1)
DELETE FROM `merchants` WHERE `id` = 1