app/controllers/ports_controller.rb

  def index
    @ports = Port.all
---
SELECT * FROM `ports`

  def show
    @port = Port.find(params[:id])
---
SELECT * FROM `ports` WHERE (`ports`.`id` = 1)