app/controllers/ships_controller.rb

SELECT * FROM `ships`
---
  def index
    @ships = Ship.all

SELECT * FROM `ships` WHERE (`ships`.`id` = 1)
SELECT * FROM `ship_items` WHERE (`ship_items`.ship_id = 1)
---
  def show
    @ship = Ship.find(params[:id])

    @ordereditems = ShipItem.find(:all, :conditions => {:ship_id => "#{@ship.id}"}, :joins => :item, :order => "slot")