app/controllers/ship_attributes_controller.rb

  def index
    @ship_attributes = ShipAttribute.all
---
SELECT * FROM `ship_attributes`

  def show
    @ship_attribute = ShipAttribute.find(params[:id])
---
SELECT * FROM `ship_attributes` WHERE (`ship_attributes`.`id` = 1)

  def edit
    @ship_attribute = ShipAttribute.find(params[:id])
---
SELECT * FROM `ship_attributes` WHERE (`ship_attributes`.`id` = 1)

  def update
    @ship_attribute = ShipAttribute.find(params[:id])
---
SELECT * FROM `ship_attributes` WHERE (`ship_attributes`.`id` = 1)

  def destroy
    @ship_attribute = ShipAttribute.find(params[:id])
    @ship_attribute.destroy
---
SELECT * FROM `ship_attributes` WHERE (`ship_attributes`.`id` = 1)
DELETE FROM `ship_attributes` WHERE `id` = 1